In [1]:
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                    import pandas as pd

In [5]:
from pandas import Series, DataFrame

In [6]:
obj = pd.Series([4, 7, -5, 3])

In [7]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [8]:
obj.values

array([ 4,  7, -5,  3], dtype=int64)

In [9]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [10]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])

In [11]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [12]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [14]:
obj2['a']

-5

In [15]:
obj2['d']=6

In [16]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [17]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [18]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [19]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [20]:
obj2 ** 2

d    36
b    49
a    25
c     9
dtype: int64

In [24]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [23]:
import numpy as np

In [25]:
'b' in obj2

True

In [26]:
'e' in obj2

False

In [27]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [28]:
obj3 = pd.Series(sdata)

In [29]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [30]:
states = ['California', 'Ohio', 'Oregon', 'Texas']

In [31]:
 obj4 = pd.Series(sdata, index=states)

In [32]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [33]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [34]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [35]:
obj4.isnull() # series

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [37]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [38]:
 obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [39]:
obj4.name = 'population'

In [40]:
obj4.index.name = 'state'

In [41]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [42]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [43]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']

In [44]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
'year': [2000, 2001, 2002, 2001, 2002, 2003],
'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [45]:
frame = pd.DataFrame(data)

In [46]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [47]:
frame.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [48]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [49]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
index=['one', 'two', 'three', 'four','five', 'six'])

In [50]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [51]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [52]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [53]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [54]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [55]:
frame2['debt'] = 16.5

In [56]:
frame2['debt'] = np.arange(6.)

In [57]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [58]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [59]:
frame2['debt'] = val

In [60]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [61]:
frame2['eastern'] = frame2.state == 'Ohio'

In [63]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [64]:
del frame2['eastern']

In [65]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [66]:
 pop = {'Nevada': {2001: 2.4, 2002: 2.9},'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [67]:
frame3 = pd.DataFrame(pop)

In [68]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [69]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [70]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [71]:
 pdata = {'Ohio': frame3['Ohio'][:-1],'Nevada': frame3['Nevada'][:2]}

In [72]:
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [73]:
 frame3.index.name = 'year'; frame3.columns.name = 'state'

In [74]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [75]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [76]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])

In [78]:
index = obj.index

In [79]:
index

Index(['a', 'b', 'c'], dtype='object')

In [80]:
index[1:]

Index(['b', 'c'], dtype='object')

In [81]:
 labels = pd.Index(np.arange(3))

In [82]:
 labels

Int64Index([0, 1, 2], dtype='int64')

In [83]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [84]:
 obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [85]:
obj2.index is labels

True

In [86]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [87]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [88]:
'Ohio' in frame3.columns

True

In [89]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])

In [90]:
dup_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [91]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [92]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [93]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])

In [94]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [95]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [96]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [97]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [98]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])

In [99]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [100]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [101]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),index=['a', 'c', 'd'],columns=['Ohio', 'Texas', 'California'])

In [103]:
frame.index.name = 'year'; frame.columns.name = 'state'

In [104]:
 frame

state  Ohio  Texas  California
year
a         0      1           2
c         3      4           5
d         6      7           8

In [106]:
states = ['Texas', 'Utah', 'California']

In [107]:
 frame.reindex(columns=states)

state  Texas  Utah  California
year
a          1   NaN           2
c          4   NaN           5
d          7   NaN           8

In [108]:
frame.iloc[['a', 'b', 'c', 'd'], states]

KeyError: 'Passing list-likes to .loc or [] with any missing labels is no longer supported, see https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike'

In [109]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

In [110]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [111]:
new_obj = obj.drop('c')

In [112]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [113]:
 obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [114]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),index=['Ohio', 'Colorado', 'Utah', 'New York'],columns=['one', 'two', 'three', 'four'])

In [115]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [116]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [117]:
data.drop('two', axis=1)  #You can drop values from the columns by passing axis=1 or axis='columns':

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [118]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [119]:
 obj.drop('c', inplace=True)

In [120]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [121]:
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])

In [122]:
 obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [123]:
obj['b']

1.0

In [124]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [125]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [126]:
obj['b':'c'] = 5

In [127]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [128]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),index=['Ohio', 'Colorado', 'Utah', 'New York'],columns=['one', 'two', 'three', 'four'])

In [129]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [130]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [131]:
 data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [132]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [133]:
data[data < 5] = 0

In [134]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [135]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int32

In [136]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [137]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [138]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [139]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [140]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [141]:
ser = pd.Series(np.arange(3.))

In [142]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [144]:
ser[-1]

KeyError: -1

In [145]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])

In [146]:
ser2[-1]

2.0

In [147]:
ser[:1]

0    0.0
dtype: float64

In [148]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [149]:
ser.iloc[:1]

0    0.0
dtype: float64

In [150]:
s1 = pd.Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])

In [151]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1],
          index=['a', 'c', 'e', 'f', 'g'])

In [152]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [153]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [154]:
s1+s2

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [155]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
index=['Ohio', 'Texas', 'Colorado'])

In [156]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [157]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [158]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [159]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [160]:
df1 = pd.DataFrame({'A': [1, 2]})

In [161]:
 df2 = pd.DataFrame({'B': [3, 4]})

In [162]:
df1

   A
0  1
1  2

In [163]:
df2

   B
0  3
1  4

In [164]:
df1-df2

    A   B
0 NaN NaN
1 NaN NaN

In [165]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)),columns=list('abcd'))

In [166]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)),columns=list('abcde'))

In [167]:
df2.loc[1, 'b'] = np.nan

In [168]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [169]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [170]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [171]:
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [173]:
1 / df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [174]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [175]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [176]:
arr = np.arange(12.).reshape((3, 4))

In [177]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [178]:
 arr[0]

array([0., 1., 2., 3.])

In [179]:
 arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [180]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [181]:
series = frame.iloc[0]

In [182]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [183]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [184]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [185]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])

In [186]:
 frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [187]:
 series3 = frame['d']

In [188]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [189]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [190]:
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [191]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [192]:
frame

               b         d         e
Utah    0.391370  0.626013 -0.717856
Ohio   -1.445782  1.189028 -0.856477
Texas   0.725811  0.712625 -0.119538
Oregon  1.989882 -0.653240  0.968814

In [193]:
np.abs(frame)

               b         d         e
Utah    0.391370  0.626013  0.717856
Ohio    1.445782  1.189028  0.856477
Texas   0.725811  0.712625  0.119538
Oregon  1.989882  0.653240  0.968814

In [194]:
f = lambda x: x.max() - x.min()

In [195]:
frame.apply(f)

b    3.435664
d    1.842268
e    1.825291
dtype: float64

In [196]:
frame.apply(f, axis='columns')

Utah      1.343869
Ohio      2.634810
Texas     0.845349
Oregon    2.643122
dtype: float64

In [197]:
def f(x):

    return pd.Series([x.min(), x.max()], index=['min', 'max'])

In [198]:
frame.apply(f)

            b         d         e
min -1.445782 -0.653240 -0.856477
max  1.989882  1.189028  0.968814

In [199]:
format = lambda x: '%.2f' % x

In [200]:
frame.applymap(format)

            b      d      e
Utah     0.39   0.63  -0.72
Ohio    -1.45   1.19  -0.86
Texas    0.73   0.71  -0.12
Oregon   1.99  -0.65   0.97

In [201]:
 frame['e'].map(format)

Utah      -0.72
Ohio      -0.86
Texas     -0.12
Oregon     0.97
Name: e, dtype: object

In [202]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [203]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [204]:
frame = pd.DataFrame(np.arange(8).reshape((2, 4)),index=['three', 'one'],columns=['d', 'a', 'b', 'c'])

In [205]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [206]:
 frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [207]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [208]:
obj = pd.Series([4, 7, -3, 2])

In [209]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [210]:
obj = pd.Series([4, np.nan, 7, np.nan, -3, 2])

In [211]:
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [212]:
 frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [213]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [214]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [215]:
 obj = pd.Series([7, -5, 7, 4, 2, 0, 4])

In [216]:
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [217]:
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [218]:
obj.rank(ascending=False, method='max')

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [219]:
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
'c': [-2, 5, 8, -2.5]})

In [220]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [221]:
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [226]:
 frame.sort_index.rank(axis=1)

AttributeError: 'function' object has no attribute 'rank'

In [223]:
obj = pd.Series(range(5), index=['a', 'a', 'b', 'b', 'c'])

In [224]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [225]:
 obj.index.is_unique

False

In [227]:
obj['a']

a    0
a    1
dtype: int64

In [228]:
 df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])

In [229]:
obj

a    0
a    1
b    2
b    3
c    4
dtype: int64

In [230]:
obj.index.is_unique

False

In [231]:
obj.index.is_unique

False

In [234]:
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],[np.nan, np.nan], [0.75, -1.3]],index=['a', 'b', 'c', 'd'],columns=['one', 'two'])

In [235]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [236]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [237]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [ ]:
df.mean(axis='columns', skipna=False)

In [238]:
df.idxmax()

one    b
two    d
dtype: object

In [239]:
df.cumsum()

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [240]:
df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [241]:
 obj = pd.Series(['a', 'a', 'b', 'c'] * 4)

In [242]:
 obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [4]:
import pandas_datareader.data as web

ModuleNotFoundError: No module named 'pandas_datareader'

In [5]:
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [3]:
import pandas as pd

In [6]:
 uniques = obj.unique()

In [7]:
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [8]:
obj.value_counts()

c    3
a    3
b    2
d    1
dtype: int64

In [9]:
pd.value_counts(obj.values, sort=False)

a    3
c    3
b    2
d    1
dtype: int64

In [10]:
pd.value_counts(obj.values, sort=False)

a    3
c    3
b    2
d    1
dtype: int64

In [11]:
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [12]:
mask = obj.isin(['b', 'c'])

In [13]:
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [14]:
 obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [15]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])

In [16]:
unique_vals = pd.Series(['c', 'b', 'a'])

In [17]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2], dtype=int64)

In [18]:
data = pd.DataFrame({'Qu1': [1, 3, 4, 3, 4],'Qu2': [2, 3, 1, 2, 3],'Qu3': [1, 5, 2, 4, 4]})

In [19]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [20]:
result = data.apply(pd.value_counts).fillna(0)

In [21]:
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [36]:
type examples/csv_mindex.csv
key1,key2,value1,value2
one,a,1,2
one,b,3,4
one,c,5,6
one,d,7,8
two,a,9,10
two,b,11,12
two,c,13,14
two,d,15,16

SyntaxError: invalid syntax (<ipython-input-36-25e06269b6e1>, line 1)

In [25]:
cat help

SyntaxError: invalid syntax (<ipython-input-25-aa387da586ad>, line 1)

In [26]:
help

Type help() for interactive help, or help(object) for help about object.

In [27]:
help(cat)

NameError: name 'cat' is not defined

In [34]:
pd.options.display.max_rows = 10

In [35]:
result = pd.read_csv('examples/ex6.csv')

FileNotFoundError: [Errno 2] File examples/ex6.csv does not exist: 'examples/ex6.csv'

In [37]:
obj = """
{"name": "Wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
{"name": "Katie", "age": 38,
"pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [38]:
import json

In [39]:
result = json.loads(obj)

In [40]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [41]:
asjson = json.dumps(result)

In [42]:
siblings = pd.DataFrame(result['siblings'], columns=['name', 'age'])

In [43]:
siblings

    name  age
0  Scott   30
1  Katie   38

In [44]:
!cat examples/example.json

'cat' is not recognized as an internal or external command,
operable program or batch file.

In [46]:
tables = pd.read_html('examples/fdic_failed_bank_list.html')

ValueError: No tables found

In [48]:
y = [4, 5, '1m']

In [49]:
y.sort()

TypeError: '<' not supported between instances of 'str' and 'int'

In [51]:
class sales:
    def _init_(self, id=50)
    self.id  = id
    id = 100
val = sales(123)
print(val.id)

SyntaxError: invalid syntax (<ipython-input-51-2bb1da6c3540>, line 2)

In [52]:
!cat examples/example.json

'cat' is not recognized as an internal or external command,
operable program or batch file.

In [54]:
ables = pd.read_html('Downloads/Data Science/pydata-book-2nd-edition/examples/examples/fdic_failed_bank_list.html')

ValueError: No tables found

In [2]:
import pandas as pd

In [18]:
frame=pd.read_csv('C:/Users/asus/Downloads/Data Science/pydata-book-2nd-edition/examples/ex1.csv')

In [19]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [22]:
frame.to_pickle('C:/Users/asus/Downloads/Data Science/pydata-book-2nd-edition/examples/frame_pickle')

In [24]:
pd.read_pickle('C:/Users/asus/Downloads/Data Science/pydata-book-2nd-edition/examples/frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [25]:
#Using HDF5 Format

In [12]:
 frame = pd.DataFrame({'a': np.random.randn(100)})

In [10]:
import pandas as pd

In [11]:
import numpy as np

In [13]:
store = pd.HDFStore('mydata.h5')

In [14]:
store['obj1'] = frame

In [15]:
 store['obj1_col'] = frame['a']

In [16]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [17]:
store['obj1']

           a
0  -1.487439
1   1.173058
2  -0.661867
3   0.154822
4  -0.234238
..       ...
95 -0.414294
96 -0.499320
97 -0.188205
98 -0.748762
99 -0.580196

[100 rows x 1 columns]

In [18]:
 store.put('obj2', frame, format='table')

In [19]:
store.select('obj2', where=['index >= 10 and index <= 15'])

           a
10  0.219081
11  0.787572
12  0.805995
13 -1.123967
14  0.397407
15 -1.121728

In [20]:
store.close()

In [21]:
 frame.to_hdf('mydata.h5', 'obj3', format='table')

In [23]:
 xlsx = pd.ExcelFile('C:/Users/asus/Downloads/Data Science/pydata-book-2nd-edition/examples/ex1.xlsx')

In [24]:
 pd.read_excel(xlsx, 'Sheet1')

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [25]:
 frame = pd.read_excel('C:/Users/asus/Downloads/Data Science/pydata-book-2nd-edition/examples/ex1.xlsx')

In [26]:
 frame

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [27]:
writer = pd.ExcelWriter('C:/Users/asus/Downloads/Data Science/pydata-book-2nd-edition/examples/ex2.xlsx')

In [28]:
frame.to_excel(writer, 'Sheet1')

In [29]:
 writer.save()

In [31]:
import requests

In [32]:
 url = 'https://api.github.com/repos/pandas-dev/pandas/issues'

In [33]:
resp = requests.get(url)

In [34]:
resp

In [35]:
data = resp.json()

In [37]:
data[0]['title']

'BUG: DataFrame.__setitem__ creates object-dtype array for 3rd Party extension type scalars'

In [38]:
issues = pd.DataFrame(data, columns=['number', 'title','labels', 'state'])

In [39]:
 issues

,number,title,labels,state
0,34959,BUG: DataFrame.__setitem__ creates object-dtyp...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
1,34958,ENH: DataFrame.query() should prioritize colum...,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
2,34957,QST: Behaviour of `mean()` for a Series of str...,"[{'id': 1954720290, 'node_id': 'MDU6TGFiZWwxOT...",open
3,34956,ENH: GH34946 Check type of names argument to `...,"[{'id': 47229171, 'node_id': 'MDU6TGFiZWw0NzIy...",open
4,34954,Fix Issue 34748 - read in datetime as MultiInd...,"[{'id': 49254273, 'node_id': 'MDU6TGFiZWw0OTI1...",open
5,34953,ENH: more distinguish name for widths arugment...,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
6,34952,"PERF: Fixed cut regression, improve Categorical","[{'id': 78527356, 'node_id': 'MDU6TGFiZWw3ODUy...",open
7,34951,BUG: ValueError on groupby with categoricals,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
8,34948,Pd.series.map performance,"[{'id': 1465286368, 'node_id': 'MDU6TGFiZWwxND...",open
9,34947,WIP: DOC: Demonstrate custom rolling indexer w...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
10,34946,BUG: Inconsistent behavior: Occasional crash o...,"[{'id': 42670965, 'node_id': 'MDU6TGFiZWw0MjY3...",open
11,34944,DOC: improve explanation of con argument DataF...,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
12,34943,BUG: exponential moving window covariance fail...,[],open
13,34942,BUG: reset_index doesn't preserve dtype on emp...,[],open
14,34941,ENH: Add NDFrame.format for easier conversion ...,[],open
15,34940,TST: disallow bare pytest raises,"[{'id': 211029535, 'node_id': 'MDU6TGFiZWwyMTE...",open
16,34939,HDFStore append_to_multiple with min_itemsize,[],open
17,34937,BUG: clear cache on DataFrame._is_homogeneous_...,[],open
18,34936,BUG: pandas.DataFrame.interpolate fails with h...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
19,34933,ENH: add ignore_index option in DataFrame.explode,[],open
20,34932,ENH: add ignore_index argument to DataFrame.ex...,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
21,34931,BUG: fix IntegerArray astype with copy=True/False,[],open
22,34928,BUG: dtype not working with datetime64,"[{'id': 42670965, 'node_id': 'MDU6TGFiZWw0MjY3...",open
23,34926,Add HTML repr for groupby dataframe and series,[],open
24,34923,Infer dtype when using `df.explode()`ENH:,"[{'id': 76812, 'node_id': 'MDU6TGFiZWw3NjgxMg=...",open
25,34922,Completely rework the capitalization check alg...,[],open
26,34921,BUG: `read_excel` function auto-fills `NaN` va...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
27,34918,CLN: avoid unnecessary consolidate_inplace calls,[],open
28,34917,Added unit test for bug mentioned in issue-34860.,[],open
29,34916,API: Default to stdlib timezone objects instea...,"[{'id': 35818298, 'node_id': 'MDU6TGFiZWwzNTgx...",open

In [40]:
import sqlite3

In [41]:
query = """CREATE TABLE test (a VARCHAR(20), b VARCHAR(20),
c REAL, d INTEGER);"""

In [42]:
con = sqlite3.connect('mydata.sqlite')

In [43]:
con.execute(query)

In [44]:
con.commit()

In [45]:
data = [('Atlanta', 'Georgia', 1.25, 6),('Tallahassee', 'Florida', 2.6, 3),
('Sacramento', 'California', 1.7, 5)]

In [46]:
stmt = "INSERT INTO test VALUES(?, ?, ?, ?)"

In [47]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

SyntaxError: invalid syntax (<ipython-input-47-91b3d3e573aa>, line 1)